{"modelTopology": {"keras_version": "2.2.2", "backend": "tensorflow", "training_config": {"loss_weights": null, "loss": "mean_squared_error", "metrics": ["accuracy"], "optimizer_config": {"class_name": "SGD", "config": {"momentum": 0.0, "nesterov": false, "lr": 0.0010000000474974513, "decay": 0.0}}, "sample_weight_mode": null}, "model_config": {"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "sigmoid", "batch_input_shape": [null, 2], "name": "dense_1", "use_bias": true, "activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "units": 15, "dtype": "float32", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "sigmoid", "name": "dense_2", "bias_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "units": 1, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true}}]}}, "weightsManifest": [{"weights": [{"name": "dense_1/kernel", "dtype": "float32", "shape": [2, 15]}, {"name": "dense_1/bias", "dtype": "float32", "shape": [15]}, {"name": "dense_2/kernel", "dtype": "float32", "shape": [15, 1]}, {"name": "dense_2/bias", "dtype": "float32", "shape": [1]}], "paths": ["group1-shard1of1"]}]}